app/controllers/comments_controller.rb

SELECT "photos".* FROM "photos" WHERE "photos"."id" = 1 LIMIT 1
---
  def new
      if session[:id]
          @title = "New Comment"
          @photo = Photo.find_by_id(params[:id])

INSERT INTO "comments" ("comment", "date_time", "photo_id", "user_id") VALUES (?, ?, ?, ?)  [["comment", "Waaay to gay"], ["date_time", nil], ["photo_id", "1"], ["user_id", "3"]]
---
  def create
      comment = Comment.new(:comment => params[:comment][:comment], :photo_id => params[:id], :user_id => params[:comment][:user_id])
      if comment.save