app/controllers/photo_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", :id]]
SELECT "photos".* FROM "photos" WHERE (user_id = CAST( 1 AS character varying(140) ))
SELECT "comments".* FROM "comments" WHERE (photo_id = CAST( 2 AS character varying(140) ))
---
  def index
      @display_user = User.find_by_id(params["id"])
      if @display_user == nil
          @display_user = "User not Found"
          return
      else
          @display_user = @display_user.first_name + " " + @display_user.last_name
      end
      photos = Photo.find(:all, :conditions => "user_id = CAST( " + params["id"] + " AS character varying(140) )")
      dummyHash = Hash.new
      for foto in photos
        dummyHash[foto] = Array.new
        comentarios = Comment.find(:all, :conditions => ("photo_id = CAST( " + foto.id.to_s + " AS character varying(140) )"))

INSERT INTO "photos" ("date_time", "file_name", "user_id") VALUES (?, ?, ?)  [["date_time", Fri, 17 May 2013 18:13:58 UTC +00:00], ["file_name", "IMG_0757.JPG"], ["user_id", "3"]]
---
  def create
      new_photo = Photo.new(:user_id => params[:photo][:user_id], :date_time => Time.now, :file_name => params[:photo][:file_name].original_filename)
      name = new_photo.file_name
      directory = "public/images/"
      path = File.join(directory, name)
      File.open(path, "wb") { |f| f.write(params[:photo][:file_name].read) }
      flash[:notice] = "File uploaded"
      if new_photo.save