app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
      @title = "User Index"
      @all_users = User.all

SELECT "users".* FROM "users" WHERE "users"."login" = 'bieber' LIMIT 1
---
  def post_login
      user = User.find_by_login(params[:user][:username])

SELECT "users".* FROM "users" WHERE "users"."login" = 'huevosabio' LIMIT 1
INSERT INTO "users" ("first_name", "last_name", "login", "password_digest", "salt") VALUES (?, ?, ?, ?, ?)  [["first_name", "Ramon"], ["last_name", "Iglesias"], ["login", "huevosabio"], ["password_digest", "1b6453892473a467d07372d45eb05abc2031647a"], ["salt", "4"]]
---
  def create
      user = User.find_by_login(params[:user][:username])
      if user
          redirect_to(:back, :flash => {:message =>'Sorry, username is already in use'})
      else
          salt = rand(10).to_s
          password = params[:user][:password]
          digest = Digest::SHA1.hexdigest(password+salt)
          user = User.new(:first_name => params[:user][:first_name], :last_name => params[:user][:last_name], :login => params[:user][:username], :salt => salt, :password_digest => digest)
          if user.save